ErpTest/src/Catalogs/уатСостояниеТС/уатСостояниеТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатСостояниеТС</name>
  <comment>Состояния ТС (уат)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВРейсе</name>
      <description>В рейсе</description>
    </items>
    <items>
      <name>Выбыло</name>
      <description>Выбыло</description>
    </items>
    <items>
      <name>ВыполнениеЗаказа</name>
      <description>Выполнение заказа</description>
    </items>
    <items>
      <name>НаКапитальномРемонте</name>
      <description>На капитальном ремонте</description>
    </items>
    <items>
      <name>НаКонсервацииИсправен</name>
      <description>На консервации исправен</description>
    </items>
    <items>
      <name>НаКонсервацииНеИсправен</name>
      <description>На консервации не исправен</description>
    </items>
    <items>
      <name>НаСреднемРемонте</name>
      <description>На среднем ремонте</description>
    </items>
    <items>
      <name>НаТекущемРемонте</name>
      <description>На текущем ремонте</description>
    </items>
    <items>
      <name>ОформленоЗадание</name>
      <description>Оформлено задание</description>
    </items>
    <items>
      <name>СформированаРазнарядка</name>
      <description>Сформирована разнарядка</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидСостояния</name>
    <comment>Вид состояния ТС</comment>
    <type>
      <types>EnumRef.уатВидыСостоянийТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВодителю</name>
    <comment>Признак оплаты водителю</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаКлиента</name>
    <comment>Признак оплаты клиентом</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ErpTest/src/Enums/уатВидыСостоянийТС/уатВидыСостоянийТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыСостоянийТС</name>
  <comment>Виды состояний ТС (уат)</comment>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>ВРейсе</name>
    <comment>В рейсе</comment>
  </enumValues>
  <enumValues>
    <name>ВПростое</name>
  </enumValues>
  <enumValues>
    <name>ВРемонте</name>
  </enumValues>
  <enumValues>
    <name>НаКонсервации</name>
  </enumValues>
  <enumValues>
    <name>Выбыло</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Catalogs/уатСостояниеТС/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	об = РеквизитФормыВЗначение("Объект");
	//уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Об, Отказ, СтандартнаяОбработка, ЭтаФорма, ДопПараметрыОткрытие);
	ЗначениеВРеквизитФормы(Об,"Объект");
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// УправлениеПредприятием.СлужебныеПодсистемы
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// Конец УправлениеПредприятием.СлужебныеПодсистемы
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидСостоянияПриИзменении(Элемент)
	Если Объект.ВидСостояния <> ПредопределенноеЗначение("Перечисление.уатВидыСостоянийТС.ВПростое") тогда
		Объект.ОплатаВодителю = Ложь;
		Объект.ОплатаКлиента  = Ложь;
	КонецЕсли;
	
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// УправлениеПредприятием.СлужебныеПодсистемы
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
КонецПроцедуры
// Конец УправлениеПредприятием.СлужебныеПодсистемы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ОплатаВодителю.Доступность = (Объект.ВидСостояния = ПредопределенноеЗначение("Перечисление.уатВидыСостоянийТС.ВПростое"));
	Элементы.ОплатаКлиента.Доступность	= (Объект.ВидСостояния = ПредопределенноеЗначение("Перечисление.уатВидыСостоянийТС.ВПростое"));	
КонецПроцедуры

#КонецОбласти
